Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གང་སྟོང་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the perfection of generosity, nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the perfection of generosity is not the perfection of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty of the perfection of wisdom [and so forth].

source: གང་སྟོང་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the perfection of wisdom [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the perfection of wisdom [and so forth] is not the perfection of wisdom [and so forth]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནང་སྟོང་པ་ཉིད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the emptiness of internal phenomena is empty of the emptiness of internal phenomena.

source: གང་སྟོང་པ་དེ་ནི་ནང་སྟོང་པ་ཉིད་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the emptiness of internal phenomena, nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ནང་སྟོང་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནང་སྟོང་པ་ཉིད་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the emptiness of internal phenomena is not the emptiness of internal phenomena.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཕྱི་སྟོང་པ་ཉིད་ནི་ཕྱི་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the emptiness of external phenomena is empty of the emptiness of external phenomena.

source: གང་སྟོང་པ་དེ་ནི་ཕྱི་སྟོང་པ་ཉིད་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the emptiness of external phenomena, nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཕྱི་སྟོང་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ཕྱི་སྟོང་པ་ཉིད་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the emptiness of external phenomena is not the emptiness of external phenomena.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཕྱི་ནང་སྟོང་པ་ཉིད་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the emptiness of external and internal phenomena is empty of the emptiness of external and internal phenomena.

source: གང་སྟོང་པ་དེ་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the emptiness of external and internal phenomena, nor does it arise.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ཕྱི་ནང་སྟོང་པ་ཉིད་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the emptiness of external and internal phenomena is not the emptiness of external and internal phenomena.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty of the emptiness of the essential nature of nonentities [and so forth].

source: གང་སྟོང་པ་དེ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the emptiness of the essential nature of nonentities [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the emptiness of the essential nature of nonentities [and so forth] is not the emptiness of the essential nature of nonentities [and so forth]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the applications of mindfulness are empty of the applications of mindfulness.

source: གང་སྟོང་པ་དེ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the applications of mindfulness, nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the applications of mindfulness is not the applications of mindfulness.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི།
en: Venerable Śāradvatīputra, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty of the noble eightfold path [and so forth].

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱ་ད་པས་སྟོང་སྟེ། གང་སྟོང་པ་དེ་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the noble eightfold path [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the noble eightfold path [and so forth] is not the noble eightfold path [and so forth].

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་།
en: Venerable Śāradvatīputra, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are empty of the distinct qualities of the buddhas [and so forth].

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་སྟེ། གང་སྟོང་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the distinct qualities of the buddhas [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the distinct qualities of the buddhas [and so forth] is not the distinct qualities of the buddhas [and so forth].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, [the spiritual goals], up to and including all-aspect omniscience, are empty of all-aspect omniscience [and so forth].

source: གང་སྟོང་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ཏེ། སྐྱེ་བ་མེད་དོ།
en: That which is empty is not all-aspect omniscience [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ། །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་འདི་སྐད་དུ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of all-aspect omniscience [and so forth] is not all-aspect omniscience [and so forth].” “

source: གཟུགས་ཀྱི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ནོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ། །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མ་ཡིན།
en: Venerable Subhūti, why do you say that the perishing of physical forms is not physical forms; that the perishing of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and so forth]; and that the perishing of the sense fields, the sensory elements, the links of dependent origination, all the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas is not the distinct qualities of the buddhas [and so forth]?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ཞེས་ཟེར། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Why do you say that the perishing of [the spiritual goals], up to and including all-aspect omniscience, are not all-aspect omniscience [and so forth]?” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་འགྲིབ་པ་གང་ཡིན་པ་དང་གཟུགས་གང་ཡིན་པ་དང་། གཉིས་སུ་བྱར་མེད་པ་གང་ཡིན་པ་དང་། འགྲིབ་པ་གང་ཡིན་པ་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། གཉིས་སུ་བྱར་མེད་པ་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ་བལྟར་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “it is because all phenomena that are perishable, that constitute physical forms, and that are not divisible into two, and [similarly all phenomena] that are perishable, that constitute feelings, perceptions, formative predispositions, and consciousness, and that are not divisible into two, are neither conjoined nor disjoined, and they share a single defining characteristic in that they are all immaterial, unrevealed, unimpeded, and without defining characteristics. “

source: །འགྲིབ་པ་གང་ཡིན་པ་དང་། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་གང་ཡིན་པ་དང་། གཉིས་སུ་བྱར་མེད་པའི་ཆོས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་གཟུགས་མེད་པ་བལྟར་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ། །འགྲིབ་པ་གང་ཡིན་པ་དང་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: All phenomena that are perishable, that constitute the sense fields, the sensory elements, and the links of dependent origination, and that are not divisible into two, are neither conjoined nor disjoined, and they share a single defining characteristic in that they are all immaterial, unrevealed, unimpeded, and without defining characteristics. “

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གང་ཡིན་པ་དང་། གཉིས་སུ་བྱར་མེད་པའི་ཆོས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་གཟུགས་མེད་པ་བལྟར་མེད་པ་ཐོགས་པ་མེད་པ་སྟེ།
en: All phenomena that are perishable, that constitute the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [the spiritual goals], up to and including all-aspect omniscience, and that are not divisible into two, are neither conjoined nor disjoined, and they share a single defining characteristic in that they are all immaterial, unrevealed, unimpeded, and without defining characteristics. “

source: འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གཟུགས་ཀྱི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ཡང་གཟུགས་མ་ཡིན། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ཡང་རྣམ་པར་ཤེས་པ་མ་ཡིན།
en: Those, Venerable Śāradvatīputra, are the formulations explaining how the perishing of physical forms is not physical forms, and the perishing of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and so forth].

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འགྲིབ་པ་གང་ཡིན་པ་དེ་ཡང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མ་ཡིན། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: The perishing of the sense fields, the sensory elements, and the links of dependent origination is not the links of dependent origination [and so forth].

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་།
en: The perishing of the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [the spiritual goals], up to and including all-aspect omniscience, is not all-aspect omniscience [and so forth].” “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འགྲིབ་པ་གང་ཡིན་པ། དེ་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ། །སྨྲས་པ། རབ་འབྱོར་ཅིའི་ཕྱིར་ན་དེ་སྐད་དུ་གང་འདི་གཟུགས་ཤེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ།
en: Subhūti, why do you say that whatever may be called physical forms, that may be counted as not two?

source: །གང་འདི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ།
en: Why do you say that whatever may be called feelings, perceptions, formative predispositions, or consciousness, that may be counted as not two?

source: །གང་འདི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཞེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ།
en: Why do you say that anything said to be anything up to and including all-aspect omniscience is categorized as not two?” “

source: །ཞེས་ཟེར། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་གཟུགས་ཀྱང་གཞན་མ་ཡིན། མ་སྐྱེས་པ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Venerable Śāradvatīputra,” replied Subhūti, “physical forms are not one distinct thing, and nonarising another. {

source: མ་སྐྱེས་པ་ཉིད་ཀྱང་གཟུགས།
en: Dt.259} The nature of nonarising is indeed physical forms.

source: གཟུགས་ཉིད་ཀྱང་མ་སྐྱེས་པ་ཏེ།
en: The nature of physical forms is indeed nonarising.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། འདི་གཟུགས་ཤེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how whatever may be called physical forms, that may be counted as not two.

source: །འདི་ལྟར་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་གཞན་མ་ཡིན་མ་སྐྱེས་པ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, feelings, perceptions, formative predispositions, and consciousness, too, are not one distinct thing, and nonarising another.

source: མ་སྐྱེས་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་མ་སྐྱེས་པ་སྟེ།
en: The nature of nonarising is indeed consciousness [and so forth]. The nature of consciousness [and so forth] is indeed nonarising.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གང་འདི་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ། །འདི་ལྟར་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: That, Venerable Śāradvatīputra, is the formulation explaining how whatever may be called consciousness [and so forth], that may be counted as not two.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: Similarly, the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are not one distinct thing, and nonarising another.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་གཞན་མ་ཡིན།
en: The nature of nonarising is indeed the distinct qualities of the buddhas [and so forth].

source: མ་སྐྱེས་པ་ཡང་གཞན་མ་ཡིན་ཏེ། མ་སྐྱེས་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས།
en: The nature of the distinct qualities of the buddhas [and so forth] is indeed nonarising.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་ཀྱང་མ་སྐྱེས་པ་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གང་འདི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཤེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how whatever may be called the distinct qualities of the buddhas [and so forth], that may be counted as not two.

source: །འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་གཞན་མ་ཡིན། མ་སྐྱེས་པ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Similarly, [the spiritual goals], up to and including all-aspect omniscience, are not one distinct thing, and nonarising another.

source: མ་སྐྱེས་པ་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད།
en: The nature of nonarising is indeed all-aspect omniscience [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མ་སྐྱེས་པ་སྟེ།
en: The nature of all-aspect omniscience [and so forth] is indeed nonarising.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གང་འདི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་དེ་ནི་གཉིས་སུ་མེད་པའི་གྲངས་སུ་བྱས་པའོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how whatever may be called all-aspect omniscience, that may be counted as not two.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཆོས་དེ་དག་ལ་དེ་ལྟར་ཡོངས་སུ་རྟོག་པ་དེའི་ཚེ། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་གཟུགས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Then the venerable Subhūti said to the Blessed One, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom and investigate those phenomena accordingly, owing to the utter purity [of physical forms], they do observe the nonarising of physical forms.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to their utter purity, they do observe the nonarising of feelings, perceptions, formative predispositions, and consciousness.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་སྐྱེ་མཆེད་རྣམས་དང་ཁམས་རྣམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྣམས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to their utter purity, they do observe the nonarising of the sense fields, the sensory elements, and the links of dependent origination.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to its utter purity, they do observe the nonarising of the perfection of generosity.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to their utter purity, they do observe the nonarising of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ། ནང་སྟོང་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to its utter purity, they do observe the nonarising of the emptiness of internal phenomena.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ།
en: Owing to their utter purity, they do observe the nonarising of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ།
en: Owing to their utter purity, they do observe the nonarising of the applications of mindfulness.

source: ཡང་དག་པར་སྤོང་བ་རྣམས་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: Owing to their utter purity, they do observe the nonarising of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.
